# IsFoundationSlab Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FloorType..::..IsFoundationSlab Property
FloorType Class See Also
---
Returns whether the element FloorAttributes type is FoundationSlab.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsFoundationSlab { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFoundationSlab As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFoundationSlab {
	bool get ();
}
```

# See Also
FloorType Class
Autodesk.Revit.DB Namespace